carnegiemellonracing/monorepo/BOOT/Src/stm32f4xx/clock.c
#include <CMR/rcc.h>                            /* RCC interface                      */
#include <CMR/panic.h>                          /* panic interface                    */
#include <stm32f4xx_hal.h>                      /* HAL interface                      */
#include "clock.h"                                 /* clock interface                     */

/**
 * Initialize the system clock
 */
void clockInit(void)
{
    _platform_rccSystemInternalClockEnable();
}

/**
 * Deinitialize the system clock
 */
void clockDeinit(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
    RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

    // Switch SYSCLK away from PLL before disabling it.
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                  | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) {
        cmr_panic("HAL_RCC_ClockConfig() failed!");
    }

    // Disable PLL and keep HSI as the system clock source.
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_OFF;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        cmr_panic("HAL_RCC_OscConfig() failed!");
    }

    __HAL_RCC_PWR_CLK_DISABLE();

}